{ "_id" : { "$oid" : "5941bdb2fb37790fb148feeb" }, "href" : "mapping-joins-and-relatio", "title" : "cat - Mapping Joins and Relationships", "image" : "cats1", "category" : 1, "text" : "The next time you binge on a guilty pleasure on Spotify, maybe you shouldn't feel so bad after all: Your streams could be helping artists in a new way. Fans First is a beta program at Spotify that targets super fans with concert ticket pre-sales, limited edition merchandise, and other exclusive perks. Not surprisingly, homing in on the music fans most likely to click a  button is an effective strategy. We're generating tens of millions of dollars in gross revenue for these artists, says Shane Tobin, who runs Spotify's creator insights and activations. A remarkable 40% of recipients are opening these Fans First emails on average, according to Tobin. So far, the pre-sales alone are generating an average of $40,000 per campaign. And many of the merch items–like a green vinyl EP by The Strokes–sell out quickly. Other artists who have tried the program include Vince Staples, Red Hot Chili Peppers, and Run The Jewels. And the list is growing. " }
{ "_id" : { "$oid" : "5947c4daf1c2b00d71e219ff" }, "href" : "behold-the-cactus", "title" : "bird - Behold the Cactus Wren! Amazing Photos of the Desert-Dwelling Birds", "image" : "bird1", "text" : "Hong Kong is one of the world’s premier financial hubs, but can it be a destination for tech startups? That was the question put to a panel of experts at the TechCrunch China event in Shenzhen today. The answer, largely, was yes but it may need a little time.\r\n\r\n“Hong Kong is becoming a global innovation center, but it needs companies to look up to,” Blake Larsen, head of international at logistics on-demand startup Lalamove, told an audience at the event.\r\n\r\nLarsen, whose company has raised more than $60 million from investors, argued that all signs point to a change in the mindset and ambition within the country, but it will take time for perceived ‘riskier’ career options to gain mainstream attention. Traditionally, banking and real-estate has been the primary choice of career for fresh graduates, who have pressure on landing a rewarding and established career to satisfy family and society. Added to that, here is no example of a tech company rising up to set an example for others to follow. Yet.\r\n\r\n“Hong Kong still lacking a little bit, finance and real estate [have] dominant marketshare in the economy and the younger generation still have that mindset,” Eric Gnock Fah, co-founder of travel tech company Klook, which recently secured a $30 million financing round led by top-tier investor Sequoia\r\n\r\n“But we also see increasing interest,” he added. “This summer we had 10 interns keen to learn more about the startup experience.”\r\n\r\nA bump in internships is something Larsen has noticed at Lalamove, while Phil Yuen, CTO of Tink Labs, agreed that student interest in startups has never been higher.\r\n\r\n“It’s a very good gauge. In the beginning [when Tink Labs started five years ago] there was barely an interest, but this year it has been significant. That’s a good sign of folks getting interested in startups,” Yuen said.", "category" : 0 }
{ "_id" : { "$oid" : "5947d654ffb54811cc498f7d" }, "href" : "dogs-are-even-more-like", "title" : "cat - Dogs Are Even More Like Us Than We Thought", "image" : "cats2", "text" : "It's likely no <p style='color: green;'>surprise to dog owners</p>, but growing research suggests that man's best <br>friend often acts more human than canine. <br>Dogs can read facial expressions, communicate jealousy, display empathy, and even watch TV, studies have shown. They've picked up these people-like traits during their evolution from wolves to domesticated pets, which occurred between 11,000 and 16,000 years ago, experts say.In particular, 'paying attention to us, getting along with us, [and] tolerating us' has led to particular characteristics that often mirror ours, says Laurie Santos, director of the Yale Comparative Cognition Laboratory. (Read more about how dogs evolved inNational Geographic magazine.)Here are a few of the latest studies showing the human side of our canine companions.", "category" : 1 }
{ "_id" : { "$oid" : "5947ec35bc41210b78a35132" }, "href" : "can-animals-predict-earth", "title" : "Can Animals Predict Earthquakes? Italian Farm Acts as a Lab to Find Out", "image" : "cats3", "text" : "A German scientist, Mr. Wikelski tagged several animals on a farm in Pieve Torina in the Marches region of central Italy in October to monitor their behavior, hoping that if it changed in some consistent way before an earthquake, it could be used as an early warning system and potentially save thousands of lives. One warm morning this spring, he came back for the findings.\r\n\r\n“Wow, it really looks as though something is there,” he said excitedly, watching as his computer crunched the data on the hood of his car in a farmyard jumbled with machinery.\r\n\r\nThe series of earthquakes in Italy began in August, with other major temblors coming in October and January, accompanied by thousands of aftershocks. The calamity has cost 23 billion euros ($26 billion) in damage, rendered thousands homeless and caused more than 300 deaths. But the consistent shaking of a largely rural and agricultural area has also provided a rare chance to test the ancient theory.<br>\r\n\r\nMr. Wikelski thinks he may be onto something, though he is cautious, and coy, about just how conclusive his data set might be. He is the first to acknowledge that some consider the idea that animals can predict disasters the stuff of old wives’ tales.<br>\r\n\r\nContinue reading the main story\r\n“We are the crazy dudes,” Mr. Wikelski said with a laugh, explaining that getting funding to pursue his project without having hard data to support it was difficult. “So we have to make absolutely sure that we don’t make any minor glitch in statistical analysis because people will try to drill holes in the whole thing, and rightly so.”", "category" : 1 }
{ "_id" : { "$oid" : "5947ec80bc41210b78a35133" }, "href" : "the-empathetic-dog", "title" : "The Empathetic Dog", "image" : "cats4", "text" : "cats Benjamin Stepp, an Iraq war veteran, sat in his graduate school course trying to focus on the lecture. Neither his classmates nor his professor knew he was silently seething.\r\n\r\nBut his service dog, Arleigh, did. She sensed his agitation and “put herself in my lap,” said Mr. Stepp, 37, of Holly Springs, Miss. “I realized I needed to get out of class. We went outside, I calmed down. We breathed.”\r\n\r\nDuring his two deployments to Iraq, Mr. Stepp endured a traumatic brain injury and multiple surgeries on his ankle, and most days he suffers excruciating pain in his legs and lower back. He says he also returned from the war with a lot of anger, which wells up at unexpected times.\r\n\r\n“Anger kept us alive overseas,” Mr. Stepp said. “You learn that anger keeps you alive.”\r\n\r\nNow that he is back, though, that anger no longer serves a useful purpose. And Arleigh, a retriever mix who came to Mr. Stepp from K9s For Warriors, a nonprofit organization that trains service dogs, has been helping him to manage it. The dog senses when his agitation and anxiety begin rising, and sends him signals to begin the controlled breathing and other exercises that help to calm him down.\r\n\r\nContinue reading the main story\r\nRELATED COVERAGE\r\n\r\n\r\nThe Vegan Dog JUNE 6, 2017\r\n\r\nAre Pets the New Probiotic? JUNE 6, 2017\r\n\r\nRUNNING WITH SHERMAN\r\nRunning With the Herd JUNE 5, 2017\r\nPet owners and trainers have long been aware of a dog’s ability to sense a human’s emotions. In the last 10 years, researchers, too, have begun to explore more deeply the web of emotions, both positive and negative, that can spread between people and animals, said Natalia Albuquerque, an ethologist who studies animal cognition at the University of São Paulo in Brazil and the University of Lincoln in England.\r\n\r\nThe spread of emotions between animals and people, or between animals — what researchers refer to as emotional contagion — is an emerging field of science. But “there are still many unanswered questions we need to address,” Ms. Albuquerque said.\r\n\r\nStudies have shown, for example, that piglets appear to become stressed by seeing and hearing other piglets that have been placed in restraints. Horses, too, appear to respond differently to people who smile or snarl; the horses responded to a snarling facial expression with an increased heart rate.\r\n\r\nOther research found that dogs and people had a similar response to hearing the sound of a human baby crying. In the study, researchers exposed 75 pet dogs and 74 people to one of three distinct sounds: a baby crying, a baby babbling and radio static. Each sound was played for more than 10 minutes, and then researchers checked their salivary cortisol levels, an indicator of stress.\r\n\r\nNeither the humans nor the dogs showed much response in cortisol levels to the sound of a baby babbling. The radio static also did not alter cortisol levels, though the humans described it as “unpleasant” and the dogs’ body language, which included lowered heads, flattened ears and lowered tails, suggested that it might have caused some distress.\r\n\r\nBut the sound of a baby crying produced a drastic response. Cortisol levels spiked in both people and dogs. The dogs responded with submissive behaviors like tucking their tails, a reaction that Ted Ruffman, a study author and professor of psychology at the University of Otago in New Zealand, described as low-level empathy.", "category" : 1 }
{ "_id" : { "$oid" : "59480c33c7a22e10ac15480c" }, "href" : "the-button-to-extract-pa", "title" : " the button to extract parts of the strin", "image" : "bird4", "text" : "<p style=\"color: green;\">asdfasdfasdfasdfasdf</p>", "category" : 0 }
{ "_id" : { "$oid" : "594af09821787c0bc471f4e2" }, "href" : "video-where-does-uber-go", "title" : "Video: Where does Uber go from here?", "image" : "cats5", "text" : "After a Virgin Mobile event today, we caught up with Virgin founder Richard Branson. When we asked about climate change and our current administration's decisions regarding it, Branson said it's the job of the world's business leaders to pick up the slack. \r\n\r\n\"I think business leaders need to step into the breach and make sure that America and the rest of the world is run on clean fuels,\" he said. \"I think by 2040, to by 2050. If you have a president that is not going to support that, then we've just got to work all the harder to make sure it comes about. Because every year this blanket that is around the earth is getting thicker and thicker, and the world is heating up and heating up, and the damage it's going to do to our grandchildren and great-grandchildren, it will be, as I've said before, too sad to imagine.\"\r\n\r\n\"I think tons of money should go into the whole battery sector,\" he added. \"I think tons of money is going into the whole battery sector. We need those breakthroughs that mean that everything is powered at nighttime by batteries when the sun is turned off.\" ", "category" : 1 }
{ "_id" : { "$oid" : "594af49321787c0bc471f4e3" }, "href" : "richard-branson-says-virg", "title" : "Richard Branson says Virgin will continue to do things with Virgin America ", "image" : "cats1", "text" : "Today Virgin Mobile announced a new iPhone-only strategy for its prepaid service. People who sign up get six months of unlimited service for $1, or 12 months if they sign up before July 31. And they get discounts and perks with a number of Virgin brands, including Virgin America, which is technically no longer part of the Virgin empire.\r\n\r\n\"Virgin America is still Virgin-branded, and I think, while it is, we'll be doing lots of things together and helping each other,\"  Virgin founder Richard Branson told Fast Company. Branson was notoriously unhappy about the airline's merger with Alaska. \"We'll decide in a few years' time, if they change the brand, whether that continues, but right now, it's great to work together.\" ", "category" : 1 }
{ "_id" : { "$oid" : "594c58e1600748108059e06b" }, "href" : "3333", "title" : "3333", "image" : "dog2", "text" : "When it comes to getting better sound for TV viewing, the sound bar option is the current favorite. Sound Bars save space, reduce speaker and wire clutter, and are definitely less hassle to set up than a full-on home theater audio system.\r\n\r\nHowever, sound bars aren't just for TV viewing, depending brand/model, you can connect additional devices and tap into features that can expand your entertainment experience.\r\n\r\nIf you are considering a sound bar, the following tips will guide you through installation, setup, and use of all the possible features.", "category" : 2 }
